'use strict';
const NodeRSA = require('node-rsa');
const db = uniCloud.database();
const {
	genIdentityId
} = require('base-common');
const {createTicket,getTokenExpire} = require('token');

exports.main = async (event, context) => {
	let token = event.token;
	//极光后台需要此公钥
	let publicKey = `-----BEGIN PUBLIC KEY-----` +
		`MIGfMA03ISeWKKAFFk0E4aUjax+a7OJEvISZ4xYKbQIDAQAB` +
		`-----END PUBLIC KEY-----`;
	let privateKey = `-----BEGIN PRIVATE KEY-----` +
		`MIICdgIBADANBgkqHsROg==` +
		`-----END PRIVATE KEY-----`;
	const result = await uniCloud.httpclient.request("https://api.verification.jpush.cn/v1/web/loginTokenVerify", {
		method: 'POST',
		headers: {
			"Authorization": "Basic ZDM1NTI4OThjYjZTRlNWMxOTcxZGQyY2ZjM2FiOWEzMQ=="
		},
		data: {
			loginToken: token
		},
		contentType: "json",
		dataType: 'json'
	});
	if (result.data.code == 8000) {
		//console.log('result', result);
		console.log('encrypted:', result.data.phone);
		
		let key = new NodeRSA(privateKey);
		//这一步很关键：encryptionScheme — padding scheme for encrypt/decrypt. Can be 'pkcs1_oaep' or 'pkcs1'. Default 'pkcs1_oaep'.
		key.setOptions({
			encryptionScheme: 'pkcs1'
		});
		let mobileName = key.decrypt(result.data.phone, 'utf8');
		console.log(mobileName);
		
		//成功获得手机号：13332903310
		const usersCollection = db.collection("users");
		const fields = {
			balance: 1,
			count: 1,
			coupons: 1,
			score: 1,
			nickname: 1,
			portrait: 1,
			id: 1,
			invite: 1,
			birthday: 1,
		};
		//检测是否已经存在
		let time = new Date().toISOString();
		let user = await db.collection("users").where({
			mobile: mobileName
		}).field(fields).limit(1).get();
		let data = {};
		
		key = new NodeRSA(publicKey);
		key.setOptions({
			encryptionScheme: 'pkcs1'
		});
		token = key.encrypt(mobileName,"base64");
		console.log(token);
		//获得有效期
		let tokenExpire = getTokenExpire();
		if (user.data.length < 1) {
			const cmd = db.command;
			data = {
				mobile: mobileName,
				nickname: getNickName(),
				portrait: "/static/missing-face.png",
				balance: 0,
				coupons: 0,
				score: 0,
				token:token,
				tokenExpire:tokenExpire,
				regist: time,
				lastLogin: time,
			};
			//生成用户id----开始-----
			data["id"] =await genIdentityId("users");
			//生成用户id----结束-----
			//新增
			let result = await usersCollection.add(data);
			data["_id"] = result.id;
		} else {
			data = user.data[0];
			data["token"] = token;
			data["lastLogin"] = time;
			//token有效期
			data["tokenExpire"] =tokenExpire;
			//更新token
			let result = await usersCollection.doc(data._id).update({
				token:token,
				tokenExpire:tokenExpire,
				lastLogin: time,
			});
		}
		//生成ticket，登录本地
		data["ticket"] = createTicket(data.id);
		//临时输出
		return {
			"code": 200,
			"message": "操作成功",
			"data": data
		};
	}
	return {
		"code": 404,
		"message": result.data.content
	};
};


/**
 * 随机获取一个昵称
 */
const getNickName = function() {
	let names = [
		'小忆控', '澜川若宁', '羁客', '全部不再', '夏见', '和我恋爱吧', '债姬', '洒一地阳光ヽ', '各空', '゛情释ヽ', '池木', '又怨', '·深陷', '-脸赞〃', '酒废', '风蛊',
		'中二柚', '新人笑', '长伴i', '治碍゛', '调妓', '微暖i', '谜兔', 'じее', '邮友', '原野', '╮执着的年纪', '清旖', '晚雾', '瑶笙', '想你只要分分秒秒', '嗫嚅',
		'网白', '作妖', '远山浅', 'ぇ气', '人生戏', '眸中客', '记忆で', '贪了杯', '哑°', '心碎的声音', '溇涏', '玻璃人', '泪意', '蓝戈者', '怂人', '孤凫', '始于初秋',
		'纵性', '终难遇', '蓝咒', '八巷', '放赐﹉', '∞白馒头', '乙白', '近箐', '东风软', '请帮我爱他', '時窥', '叫嚣ゝ', '回心转意。', '榕城若虚', '征棹', '揽月',
		'不奢求什么丶', '风月客', '陪你到最终〆', '苏大泽ㄣ', '小姐丶请自重', '︶葆Ⅱㄣ', '汐鸠', '暮年', '转身泪倾城', '我做我的改变', '-旧情别恋。', '苏别ゝ', '木格〃', '海夕',
		'枫以', '毁虫ゝ', '南烟', '◇不必了。', '那些过往。', '苍白女子ヽ', '忱杏', '猫腻', '君勿笑', '梦里人', '大海や', '︶￣淡然', '朮生', '番薯＊', '禾厶谷欠', '慵挽',
		'杯别', '相思碎', '忆沫', '弄潮', '并安', 'ζ澈沫', '幸福丶如此', '傲影', '倦话', '迷爱·', '骑趴！', '中性美', '友欢', '你好，陌生人', 'ゝ杯具ˊ', '___失温。',
		'痴者', '挽梦忆笙歌', '垂暮老矣', 'ㄟ。诗瑗', '執念〞', '仅冇旳回忆', '梦一生花开无言', '清引', '护你周全', '御守', '厌味', '慢慢从新开始', '无妨#', '不爱素颜', '橘寄',
		'冧九', '缘字诀', '香橙ぽ', '烟酉', '帅冕', '-另类', '泅人', '舟遥客', 'つ可否回来', '子栖', '游魂°', '萌酱', '束缚ｍ︿', '霊感', '许久', '莫多说', '乜一',
		'一张白纸-°', '两仪', '樱娆', '失退〃', '十雾', '浴红衣', 'ヤ经典坏疍', '送舟行', '抠脚大汉！', '路弥', '初懵', '奢欲', '嘿咻！', '甜是你', '梦亿', '行雁书',
		'纵山崖', '别闹i', '花想c', '日久见人心', '巨坚强', '李不', '池予', '寄离', '帝王念', '入画浅相思', '零度℉', '娇妻。', '榆西', '書生途', '扎心', 'A君。',
		'|煩躁', '星', '谷夏', '够运-', '笑咖', '北风几吹夏-', '匿名。', '赠佳期', '戈亓', '无声情话', '椒妓', '心安伴我暖', '哆啦不做梦', '凉城已无爱', '五里雾', '用心笑*',
		'岛徒', '流殇', '轮廓§', '千寻…', '山有枢', '夜深人未静ゅ', '任性一次', '亚希ぅ', '森林散布。', '半衾梦', '素年丶', '腻橙味', '空宴', '溺渁∝', '清眉祭', '陪我终i',
		'予囚', '开始看清了', '箹锭⒈辈孓', '绿萝', '小女人ら', '空心↖', '吝吻', '凹づ凸ル', '花桑', '〃安静', '对不⑦', '祗昰~', '百善笑为先', '沧桑㈠', '花辞树', '橘亓',
		'凉墨', '弥枳', '-旧情勿念。', '尤怨', '叹倦', '小鸟爱天空丶', '黯淡〆', '浅唱ヾ落雨殇', '留蓝', '此刻的回忆', '人疚。', '罪歌', '旧人哭', '傾旎', '我要还你自由',
		'っ左', '满栀', '梦罢', '白况', '倒数', '“停滞”', '千紇', '盗琴音', '囍孤女', ':悲凉≈”', '忘羡', '爱，才寂寞。', '许一世地老天荒', '铃予', '离鸿', '找回味觉',
		'长发绾君心', '就像说晚安', '锦爱〃', '朱染', '饮湿', '﹏゛嗼ふ静', '望喜', '黎歌', '画尸师', 'ら。栖息', '星軌x', '花伊自在美', '枉心', '伴我老i', '探春', '浸婚纱',
		'笙痞', '吻风', '生生漫', '兔姬', '握住你手', '七禾', '逆流。', '以酷', '述情', '萌辣', '辞取', '痴骨ら', 'ゝ偶尔ゞ', '锦欢', '绮烟', '残疾', '允世', '¨。骷髅',
		'晌融', '挖鼻大婶！', '比忠', '半枫', '时常饿', '﹏ゞ记忆︶ㄣ', '酒绊', '情愿ヽ', '音盲', '迷爱·', '无畏u。', '好倦', '活雷疯！', '挽清梦', '但可醉心', '弥繁',
		'决绝ぐ', '_蜘蛛', '梦途', '欲拥i', '毁梦', '‖放下', 'ˉ厌', '献世佛', '鹿童谣', '猫卆', '澉约', '妥活', '止于盛夏', '暗喜', '彡翼', '無心', '浮生面具三千个',
		'笑忘罢', '厌倦', '浅听莫相离', '初雪', '情徒', '李白°', '欢烬', '如果没有', '回首观望', '云胡', '青朷', '＿＿椵侞', '熟人话多', '神妖', '请爱~陌生人', '拥醉',
		'南七夏', '素手挽清风', 'み零。', '素罗衫', '牵强ㄟ', '眼藏柔', '茶花眉', '稀香', '小苏打饼。', '薄荷港', '遇到', '陌生。', '计㈡愣〆', '别想她╰', '倒带', '微凉',
		'放手', '╭ゆ眷念', '陌伤ぢ', '尝蛊', '╰沐子', '久随', '会傲', '那伤。', '绅士风度i', '尾戒~', '小嗲', '撩人痒', '空名', '请别遗忘我', '。咿呀咿呀哟', '过潦',
		'逐鹿', '我很OK', '公布', '岁吢', '简美﹌', '-燃情℡', '美男兮', '仅一夜美梦ヽ', '吲‖鸣', '夜巴黎╮', '久隐师', '殊姿', '单调的奢华', '南城追梦i', '以往的大感动',
		'眼趣', '一萌ing', '山人契', '逆蝶', 'ぶ宁プ宁ぶ', '闻呓', '╰つ倒转', '哽咽笑', '枕花眠', '顾北清歌寒゜', '何其悲哀', '泪眸﹌', '默嘫て', '旧竹', '呆头', '貪欢',
		'枕梦', '忘你却要生生世世', '零度°', '多像笑话', '入怼', '离旧人。', '七堇年。', '千秋岁', '極樂鬼', '避讳。', '风流物', '剩余の解释。', '遗弃Ｍ', '陈年往事', '蓝礼',
		'聊慰', '春夜浅', '倥絔', '同尘', '彻夜缠绵', '慕巷i', '_畞蕅', '黑白记忆_', '清醇，', '青春如此纠结', '╄→承喏。', '如果没有你', 'ぃ双果', '谜泪i', '梦冥', '音盲',
		'羞稚', '绝不放开', '无所的畏惧', '酒中人', '节枝', '遮云壑', '橘香', '情绪', '醉南桥', '玩世', '野侃', '昨迟人', '梦言归人', '怼怹恏', '水溶，', '鹿!', '丑疤怪',
		'标点╮', '绅刃', '寄人书', '那请放手', '鸠魁', '淑女气质i', '開玄', '属性·', '战皆罪', '谁人与我共长歌', 'So要识趣', '木落', '千鲤', '桜花祭', '痴情', '山川志',
		'无可置疑。', '桃扇骨', '佞臣', '北音执念i', '﹏向日葵°', '哀由', '跨年。', '演出会有结束', '风渺', '请你别敷衍ら', '隐诗', '塔塔猫', '婴鹅', '夏末', '眉目亦如画i',
		'唠甜嗑', '方觉久', '风吹过旳痕迹', '七婞', '若能看破又如何', '望笑', '千仐', '阪姬', '半仙', '鸠书', '昇り龍', '野の', '翻身的咸鱼', '乄_﹏柒ぐ汐', '假装不在乎',
		'爱本泡沫多脆弱', '简单爱', '暖阳°', '一抹淡然', 'π浅易', '一刻暧昧。', '温折酒', '回忆那么伤', '月棠', '泪之魂', '如何视而不见', '弃爱', '信愁', '请止步禁区', '〆凄凉。',
		'终难愈', '┈┾☆殇', '没企图', '绮筵', '三生路', '无语#', '鱼窥荷', '饮惑', '谎言丶', '┼──瘾||', '苄①跕圉湢', '橪书', '丑丑阿', '私野', '偏闹i', '凉栀',
		'缪败', '獨角戲', '别忘他╰', '短叹', '︶￣戏舞', '怀念你的温柔', '街角卖回忆', '森罗', '何以笙箫默', '孤星', '愛上了。', '自控〃', '红颜悴', '帅的被狗咬', '土豪！！！',
		'红焚', '烈酒灼喉', '甜中书', '染墨丶若流云', '紅太極', '云裳', '初吻给了烟', '苏佲洛', '思慕', '北渚', '葬心', '唔猫', '云柯', '囍笑', '咋地', '任谁', '清秋。悲枫',
		'吻安', '佼人', '天涯沦落人i', '惟欲睡', '寄与心', '喜你已久', '南风几经秋-', '稚然', '暖伴', '风铃鹿', '辞慾', '野稚', '落花随流水', '剧终人散尽', '蒗幽', '末蓝',
		'病毒体', '美人骨', '赠意', '稳稳的幸福', '亢潮', '丶视觉', '栖迟', '°懵少女', '稀香', '灯角i', '拥抱没勇气', '一抹微笑', '呢古', '风情万种。', '对风讲故事', '情域',
		'昵称有卵用', '木緿', '娇纵', '云巢', '听不够的曲调', '救星。', '戒ㄋ', '╰╮夏尔', '牵你手', '呆°', '贪恋'
	];
	let index = parseInt(Math.random()*names.length);
	return names[index];
}
